status = -1;
var itemList = Array(
// ------ 卷轴 ------
        Array(2049100, 500, 1, 2), //混沌卷轴60%
        Array(2340000, 600, 1, 2), //祝福卷轴
        Array(2049752, 100, 1, 2), //S级潜能卷轴 30%
        Array(2049750, 50, 1, 3),
        Array(2049704, 500, 1, 2), //A级潜能附加卷轴 40%
        Array(2048311, 500, 1, 2), //附加潜能附加卷轴 50%
        Array(2049304, 500, 1, 2), //3星装备强化卷轴 80%
        Array(2049135, 300, 1, 2),
        Array(2049137, 150, 1, 3),
// ------ 装备 ------
        Array(1112915, 500, 1, 2), //蓝调戒指
        Array(2432069, 2, 1, 3), //暴君防具交换
//
        Array(2046913, 150, 1, 3), // 宿命正义单手武器攻击力卷轴 100% // 为单手武器增加攻击力属性。
        Array(2046914, 150, 1, 3), // 宿命正义单手武器魔力卷轴 100% // 为单手武器增加魔法攻击力属性。
        Array(2046173, 150, 1, 3), // 宿命正义双手武器攻击力卷轴 100% // 为双手武器增加攻击力属性。
        Array(2046577, 150, 1, 3), // 宿命正义防具力量卷轴 100% // 为防具增加力量属性。
        Array(2046578, 150, 1, 3), // 宿命正义防具智力卷轴 100% // 为防具增加智力属性。
        Array(2046579, 150, 1, 3), // 宿命正义防具敏捷卷轴 100% // 为防具增加敏捷属性。
        Array(2046580, 150, 1, 3), // 宿命正义防具运气卷轴 100% // 为防具增加运气属性。
        Array(2046763, 150, 1, 3), // 宿命正义饰品力量卷轴 100% // 为饰品增加力量属性。
        Array(2046764, 150, 1, 3), // 宿命正义饰品智力卷轴 100% // 为饰品增加智力属性。
        Array(2046765, 150, 1, 3), // 宿命正义饰品敏捷卷轴 100% // 为饰品增加敏捷属性。
        Array(2046766, 150, 1, 3), // 宿命正义饰品运气卷轴 100% // 为饰品增加运气属性。
        Array(1012283, 50, 1, 3), // 烈日脸饰 // (无描述)
//帅气勋章

        Array(1142500, 100, 1, 3), // 神秘班·雷昂的恶梦 // (无描述)
        Array(1142501, 100, 1, 3), // 神秘阿卡伊勒的恶梦 // (无描述)
        Array(1142502, 100, 1, 3), // 神秘希拉的恶梦 // (无描述)
        Array(1142503, 100, 1, 3), // 神秘扎昆的恶梦 // (无描述)
        Array(1142504, 100, 1, 3), // 神秘暗黑龙王的恶梦 // (无描述)
        Array(1142505, 100, 1, 3), // 神秘之门研究者 // (无描述)

// 图腾
        Array(1202023, 600, 1, 3), // 真·乔图腾 // 聚集了乔的强烈灵魂的强力图腾。
        Array(1202024, 600, 1, 3), // 金·乔图腾 // 根据乔的样子所做的黄金图腾。
        Array(1202025, 600, 1, 3), // 银·乔图腾 // 根据乔的样子所做的银图腾。
        Array(1202026, 600, 1, 3), // 木·乔图腾 // 根据乔的样子所做的木图腾。
        Array(1202027, 600, 1, 3), // 真·海丽蜜图腾 // 聚集了海丽蜜的强烈灵魂的强力图腾。
        Array(1202028, 300, 1, 3), // 金·海丽蜜图腾 // 根据海丽蜜的样子所做的黄金图腾。
        Array(1202029, 300, 1, 3), // 银·海丽蜜图腾 // 根据海丽蜜的样子所做的银图腾。
        Array(1202030, 300, 1, 3), // 木·海丽蜜图腾 // 根据海丽蜜的样子所做的木图腾。
        Array(1202031, 300, 1, 3), // 真·小龙图腾 // 聚集了小龙的强烈灵魂的强力图腾。
        Array(1202032, 300, 1, 3), // 金·小龙图腾 // 根据小龙的样子所做的黄金图腾。
        Array(1202033, 300, 1, 3), // 银·小龙图腾 // 根据小龙的样子所做的银图腾。
        Array(1202034, 300, 1, 3), // 木·小龙图腾 // 根据小龙的样子所做的木图腾。
        Array(1202035, 300, 1, 3), // 真·李卡司图腾 // 聚集了李卡司的强烈灵魂的强力图腾。
        Array(1202036, 300, 1, 3), // 金·李卡司图腾 // 根据李卡司的样子所做的黄金图腾。
        Array(1202037, 300, 1, 3), // 银·李卡司图腾 // 根据李卡司的样子所做的银图腾。
        Array(1202038, 300, 1, 3), // 木·李卡司图腾 // 根据李卡司的样子所做的木图腾。
        Array(1202039, 300, 1, 3), // 黑·酷咪图腾 // 根据穿着黑色运动服的酷咪导师的样子所做的图腾。
        Array(1202040, 300, 1, 3), // 粉·酷咪图腾 // 根据穿着粉红色运动服的酷咪导师的样子所做的图腾。
        Array(1202041, 300, 1, 3), // 白·酷咪图腾 // 根据穿着白色运动服的酷咪导师的样子所做的图腾。
        Array(1202042, 300, 1, 3), // 红·酷咪图腾 // 根据穿着红色运动服的酷咪导师的样子所做的图腾。
        Array(1202083, 300, 1, 3), // 真·伊昆图腾 // (无描述)
        Array(1202084, 300, 1, 3), // 金·伊昆图腾 // (无描述)
        Array(1202085, 300, 1, 3), // 银·伊昆图腾 // (无描述)
        Array(1202086, 300, 1, 3), // 铜·伊昆图腾 // (无描述)
//Array(1202098, 600, 1, 3),  // 未知的便当图腾 // 无任何属性的空白图腾.制作便当的话也许长老斯坦会根据美味来进行升级.
        Array(1202099, 600, 1, 3), // 深蓝色便当图腾 // 升级1次的图腾.
        Array(1202100, 300, 1, 3), // 紫色便当图腾 // 升级2次的图腾.
        Array(1202101, 300, 1, 3), // 绿色便当图腾 // 升级3次的图腾.
        Array(1202102, 300, 1, 3), // 红色便当图腾 // 升级4次的图腾.
        Array(1202103, 300, 1, 3), // 蓝色便当图腾 // 升级5次的图腾.
        Array(1202104, 300, 1, 3), // 黄色便当图腾 // 升级6次的图腾.
        Array(1202105, 300, 1, 3), // 橘黄色便当图腾 // 升级7次的图腾.
        Array(1202106, 300, 1, 3), // 真正的便当图腾 // 升级8次的图腾.
        Array(1202107, 300, 1, 3), // 斯坦的美味便当图腾 // 这是受到感动的长老斯坦所给予,装满祝福的最终版美味图腾.
        Array(1202108, 300, 1, 3), // 真深蓝色便当图腾 // 升级1次的图腾.
        Array(1202109, 300, 1, 3), // 真紫色便当图腾 // 升级2次的图腾.
        Array(1202110, 300, 1, 3), // 真绿色便当图腾 // 升级3次的图腾.
        Array(1202111, 300, 1, 3), // 真红色便当图腾 // 升级4次的图腾.
        Array(1202112, 300, 1, 3), // 真蓝色便当图腾 // 升级5次的图腾.
        Array(1202113, 300, 1, 3), // 真黄色便当图腾 // 升级6次的图腾.
        Array(1202114, 300, 1, 3), // 真橘黄色便当图腾 // 升级7次的图腾.
        Array(1202115, 300, 1, 3), // 真正的便当图腾 // 升级8次的图腾.
        Array(1202094, 300, 1, 3), // 王魔女图腾 // 表现出班主任王美女真正恐怖之处的图腾
        Array(1202095, 300, 1, 3), // 王美女图腾 // 表现出班主任王美女深藏不露之美的图腾
        Array(1202096, 300, 1, 3), // 王微笑图腾 // 表现出班主任王美女多情一面的图腾
        Array(3010007, 300, 1, 3), // 粉色海豹靠垫, 10, 1, 3), // 是一款可爱的粉色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010008, 300, 1, 3), // 蓝色海豹靠垫, 10, 1, 3), // 是一款可爱的蓝色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010009, 300, 1, 3), // 榻榻凳, 10, 1, 3), // 有着心型靠垫的可爱的凳子．坐着的时候每10秒回复HP 20, MP 30
        Array(3010010, 300, 1, 3), // 白色海豹靠垫, 10, 1, 3), // 是一款可爱的白色海豹模样的靠垫，靠在上面每10秒钟HP恢复50。
        Array(3010014, 300, 1, 3), // 月亮弯, 10, 1, 3), // 每10秒钟恢复HP&MP30，无法交换&交易.
        Array(3010016, 300, 1, 3), // 黑色海豹靠垫, 10, 1, 3), // 是一款可爱的黑色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010017, 300, 1, 3), // 金色海豹靠垫, 10, 1, 3), // 是一款可爱的金色海豹模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010018, 300, 1, 3), // 椰子树沙滩椅, 10, 1, 3), // 放置在阿里安特凉爽的椰子树树荫下的沙滩椅。坐下时，每10秒中，恢复HP 40, MP 20。
        Array(3010029, 300, 1, 3), // 蓝环凳, 10, 1, 3), // 闪耀着蓝色光芒的圆环凳子
        Array(3010030, 300, 1, 3), // 黑环凳, 10, 1, 3), // 闪耀着黑色光芒的圆环凳子
        Array(3010031, 300, 1, 3), // 红环凳, 10, 1, 3), // 闪耀着红色光芒的圆环凳子
        Array(3010032, 300, 1, 3), // 黄环凳, 10, 1, 3), // 闪耀着黄色光芒的圆环凳子
        Array(3010033, 300, 1, 3), // 绿环凳, 10, 1, 3), // 闪耀着绿色光芒的圆环凳子
        Array(3010039, 300, 1, 3), // 黑色海狗靠垫, 10, 1, 3), // 是一款可爱的黑色海狗模样的靠垫，靠在上面每10秒钟HP恢复60。
        Array(3010046, 300, 1, 3), // 红龙椅, 10, 1, 3), // 与红龙一起休息,每10秒可恢复HP 60.
        Array(3010047, 300, 1, 3), // 蓝龙椅, 10, 1, 3), // 与蓝龙一起休息,每10秒可恢复MP 60.
        Array(3010181, 300, 1, 3), // MP椅子 , 10, 1, 3), // 坐在上面可以感受补MP的快感，每10秒钟可恢复MP50
        Array(3010406, 300, 1, 3), // 迷你神兽椅子, 10, 1, 3), // 坐在迷你神兽椅子上，每10秒恢复HP50, MP50。
        Array(3010691, 300, 1, 3), // 粉色海豹椅子, 10, 1, 3), // 可爱的粉色海豹椅子。每10秒，HP和MP各恢复50。
        Array(3010692, 300, 1, 3), // 蓝色海豹椅子, 10, 1, 3), // 可爱的蓝色海豹椅子。每10秒，HP和MP各恢复50。
        Array(3010405, 3, 1, 3), // 摆钟椅子, 3, 1, 3), // 坐在摆钟椅子上，每10秒恢复HP50, MP50。
        Array(3010406, 3, 1, 3), // 迷你神兽椅子, 3, 1, 3), // 坐在迷你神兽椅子上，每10秒恢复HP50, MP50。
        Array(3010421, 3, 1, 3), // 发财椅, 3, 1, 3), // 即便短暂，也去感受下大款们的感觉吧！每10秒恢复HP100点，MP50点。
        Array(3010586, 3, 1, 3), // 发财椅, 3, 1, 3), // 即便短暂，也去感受下大款们的感觉吧！每10秒恢复HP100点，MP50点。
        Array(3010423, 3, 1, 3), // 蘑菇朋友椅子, 3, 1, 3), // 又可爱又好吃，去和蘑菇交朋友吧。每10秒恢复HP100点，MP50点。
        Array(3010505, 3, 1, 3), // 和奥尔卡一起看棒球, 3, 1, 3), // 和奥尔卡、斯乌一起愉快的玩棒球。坐下每10秒恢复50点HP和MP。
        Array(3010506, 3, 1, 3), // 万圣节南瓜椅, 3, 1, 3), // 为了纪念万圣节而制作的椅子。休息期间，每10秒HP恢复50点。 
        Array(3010516, 3, 1, 3), // 噜噜啦啦印第安小孩, 3, 1, 3), // 成为了淘气的印第安小孩们的俘虏。每10秒HP恢复50点，MP恢复50点。
        Array(3010517, 3, 1, 3), // 印第安小孩的朋友, 3, 1, 3), // 和印第安村庄中生长出来的新芽一起，沉醉在丛林的寂静中吧。每10秒HP恢复50点，MP恢复50点。
        Array(3010518, 3, 1, 3), // 印第安元老的兄弟, 3, 1, 3), // 真诚的印第安元老们，坐下来感觉很有负担。坐在上面时，每10秒HP恢复50点，MP恢复50点。
        Array(3010519, 3, 1, 3), // 巨大白雪人椅子, 3, 1, 3), // 企鹅王一定会羡慕的。体验变成企鹅国王的感觉吧。每10秒HP恢复50点，MP恢复50点。 
        Array(3010520, 3, 1, 3), // 巨大企鹅王椅子, 3, 1, 3), // 企鹅王什么的很容易驯服。为帅气的我特别准备的椅子。每10秒HP恢复50点，MP恢复50点。 
        Array(3010521, 3, 1, 3), // 水晶椅, 3, 1, 3), // 用闪闪发光的神秘水晶做成的椅子。看上去很昂贵。休息期间，每10秒HP恢复50点。
        Array(3010522, 3, 1, 3), // 兔子旋风, 3, 1, 3), // 狂躁的兔子乘着旋风飞起来了。注意保持重心。每10秒HP恢复50点，MP恢复50点。 
        Array(3010523, 3, 1, 3), // 白云漫步椅, 3, 1, 3), // 让人感觉像在天上漫步一样的椅子。每10秒HP恢复50点，MP恢复50点。
        Array(3010524, 3, 1, 3), // 威尔士柯基犬椅子, 3, 1, 3), // 可以成为可爱的威尔士柯基犬们的朋友的椅子。坐在上面时，每10秒HP恢复50点，MP恢复50点。
        Array(3010525, 3, 1, 3), // 猫头鹰椅子, 3, 1, 3), // 可以让人理解关在鸟笼中的猫头鹰的心情的椅子。坐在上面时，每10秒HP恢复50点，MP恢复50点。
        Array(3010526, 3, 1, 3), // 白鹳飞行员椅子, 3, 1, 3), // 喙的力量世界最强的白鹳飞行员椅子。坐在上面时，每10秒HP恢复50点，MP恢复50点。
        Array(3010530, 3, 1, 3), // 埃欧雷的小型音乐会, 3, 1, 3), // 可以欣赏精灵女王双弩精灵的特别演唱会的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010531, 3, 1, 3), // 小企鹅合唱团, 3, 1, 3), // 正在唱圣诞颂歌的小企鹅们。每10秒HP恢复50，MP恢复50。
        Array(3010532, 3, 1, 3), // 蓝色木椅, 3, 1, 3), // 只能在明珠港买到的蓝色木椅。 坐在上面，每10秒HP恢复35。
        Array(3010533, 3, 1, 3), // 椰子树沙滩椅, 3, 1, 3), // 放在阿里安特凉爽的椰子树下的沙滩椅。坐在上面，每10秒HP恢复40，MP恢复20。
        Array(3010534, 3, 1, 3), // 公沙沙兔靠垫, 3, 1, 3), // 靠着可爱的公沙沙兔坐着，每10秒HP恢复60。
        Array(3010535, 3, 1, 3), // 海蓝天鹅绒沙发, 3, 1, 3), // 奢华的海蓝色天鹅绒沙发。坐在上面，每10秒HP恢复60。
        Array(3010536, 3, 1, 3), // 红色设计师椅子, 3, 1, 3), // 采用明亮红色的设计师椅子。坐在上面，每10秒HP恢复60。
        Array(3010537, 3, 1, 3), // 恶灵附身的娃娃椅子, 3, 1, 3), // 恶灵附身的娃娃椅子。坐在上面，每10秒HP恢复50。
        Array(3010538, 3, 1, 3), // 机械椅, 3, 1, 3), // 坐在上面，每10秒恢复HP的机械椅。
        Array(3010539, 100, 1, 3), // 红色龙椅, 3, 1, 3), // 有严肃的火龙相伴的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010540, 100, 1, 3), // 蓝色龙椅, 3, 1, 3), // 有严苛的青龙相伴的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010541, 3, 1, 3), // 发财椅, 3, 1, 3), // 暂时感受一下富翁的感觉吧！每10秒HP恢复100，MP恢复50。
        Array(3010542, 3, 1, 3), // 夏日喵喵椅, 3, 1, 3), // 和猫咪一起在电扇前面闲坐吧！每10秒HP恢复50，MP恢复50。
        Array(3010543, 3, 1, 3), // 魔力品克缤, 3, 1, 3), // 可以体验到品克缤的强大魔力的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010544, 3, 1, 3), // 热带夏日椅子, 3, 1, 3), // 满眼都是水果！每10秒HP恢复50，MP恢复50。
        Array(3010545, 3, 1, 3), // 千年狐椅子, 3, 1, 3), // 梦幻的千年狐椅子。每10秒HP恢复50，MP恢复50。
        Array(3010546, 3, 1, 3), // 邪恶黑龙椅子, 3, 1, 3), // 代表着黑暗的王座。每10秒HP恢复50，MP恢复50。
        Array(3010547, 3, 1, 3), // 魔法之书, 3, 1, 3), // 会让人感觉变聪明。每10秒HP恢复50，MP恢复50。
        Array(3010548, 3, 1, 3), // 可爱音符椅子, 3, 1, 3), // 让人很想邀请恋人一起坐的椅子。没有恋人的话，就独自享受孤独吧。每10秒HP恢复50，MP恢复50。
        Array(3010549, 3, 1, 3), // 羊羔椅子, 3, 1, 3), // 毛绒绒的羊羔。让人不想出去打猎。每10秒HP恢复50，MP恢复50。
        Array(3010550, 3, 1, 3), // 寻找故乡的月妙椅子, 3, 1, 3), // 据说会在明后天带着年糕回来。每10秒HP恢复50，MP恢复50。
        Array(3010551, 3, 1, 3), // 邪恶之毒椅子, 3, 1, 3), // 看上去非常凶恶的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010552, 3, 1, 3), // 喵喵的免费拥抱, 3, 1, 3), // 看上去很善良的猫咪。感觉像跟人拥抱一样的猫咪椅子。每10秒HP恢复50，MP恢复50。
        Array(3010553, 3, 1, 3), // 邪恶羊椅子, 3, 1, 3), // 可怕的羊。不要随便喂它。每10秒HP恢复50，MP恢复50。
        Array(3010554, 3, 1, 3), // 粉色手柄, 3, 1, 3), // 梦想进入游戏排名的少女的梦想，粉红色的游戏手柄椅子。每10秒HP恢复50，MP恢复50。
        Array(3010555, 3, 1, 3), // 深夜猫头鹰, 3, 1, 3), // 寂静森林中的猫头鹰，还有我。每10秒HP恢复50，MP恢复50。
        Array(3010556, 3, 1, 3), // 皮肤皇后椅子, 3, 1, 3), // 不要害羞。专为在皮肤保养方面决不妥协的你准备的椅子。每10秒HP恢复50，MP恢复50。
        Array(3010557, 3, 1, 3), // 睡觉小鸟椅子, 3, 1, 3), // 坐在天真的小鸟们中间，和它们一起打盹吧。每10秒HP恢复50，MP恢复50。
        Array(3010558, 3, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
        Array(3010559, 3, 1, 3), // 龙蛋, 3, 1, 3), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。

        Array(1190401, 300, 1, 3), // C等级BOSS竞技场徽章 // (无描述)
        Array(1190402, 200, 1, 3), // B//等级BOSS竞技场徽章 // (无描述)
        Array(1190403, 100, 1, 3), // B等级BOSS竞技场徽章 // (无描述)
        Array(1190404, 100, 1, 3), // B+等级BOSS竞技场徽章 // (无描述)
        Array(1190405, 100, 1, 3), // A等级BOSS竞技场徽章 // (无描述)
        Array(1190406, 100, 1, 3), // A+等级BOSS竞技场徽章 // (无描述)
        Array(1190407, 50, 1, 3), // S等级BOSS竞技场徽章 // (无描述)
// ------ 特殊 ------
        Array(5064300, 600, 2, 2), //卷轴防护卷轴
        Array(5062500, 600, 1, 2), //大师附加神奇魔方
        Array(5062000, 600, 2, 2), //神奇魔方
//Array(5064000, 600, 1, 2), //防爆卷轴
        Array(5064100, 600, 1, 2), //保护卷轴
        Array(5062002, 600, 1, 2), //高级神奇魔方
// ------ 150级武器 ------
        Array(1402196, 2, 1, 3),
        Array(1432167, 2, 1, 3),
        Array(1452205, 2, 1, 3),
        Array(1462193, 2, 1, 3),
        Array(1472214, 2, 1, 3),
        Array(1332225, 2, 1, 3),
        Array(1342082, 2, 1, 3),
        Array(1362090, 2, 1, 3),
        Array(1382208, 2, 1, 3),
        Array(1372177, 2, 1, 3),
        Array(1212063, 2, 1, 3),
        Array(1242060, 2, 1, 3),
        Array(1232057, 2, 1, 3),
        Array(1522094, 2, 1, 3),
// 椅子 
        Array(3010225, 50, 1, 3),
        Array(3010226, 50, 1, 3),
        Array(3010824, 50, 1, 3),
        Array(3010825, 50, 1, 3),
        Array(3010826, 50, 1, 3),
        Array(3010827, 50, 1, 3),
        Array(3010829, 50, 1, 3),
        Array(3010828, 50, 1, 3),
        Array(3010830, 50, 1, 3),
        Array(3010831, 50, 1, 3),
//Array(3010832, 50, 1, 3),
        Array(3010279, 50, 1, 3),
        Array(4310030, 100, 10, 3), //运动会币
        Array(4310030, 70, 50, 3),
        Array(4310030, 50, 100, 3),
        Array(4310036, 300, 10, 3), //征服者币
        Array(4310036, 200, 50, 3), //征服者币
        Array(4310036, 100, 100, 3), //征服者币
//必成卷
        Array(2040006, 200, 1, 3), //头盔防御
        Array(2040007, 200, 1, 3), //头盔体力
        Array(2040303, 200, 1, 3), //耳环智力
        Array(2040403, 100, 1, 3), //上衣防御
        Array(2040506, 200, 1, 3), //全身铠甲敏捷
        Array(2040507, 300, 1, 3), //防御
        Array(2040603, 300, 1, 3), //裤裙防御
        Array(2040709, 200, 1, 3), //鞋子敏捷
        Array(2040710, 200, 1, 3), //鞋子跳跃
        Array(2040711, 200, 1, 3), //鞋子速度
        Array(2040806, 200, 1, 3), //手套敏捷
        Array(2040903, 200, 1, 3), //盾牌防御
        Array(2041024, 200, 1, 3), //披风魔防
        Array(2041025, 200, 1, 3), //披风物防
        Array(2043003, 100, 1, 3), //单手剑攻击
        Array(2043103, 100, 1, 3), //斧
        Array(2043203, 100, 1, 3), //钝器
        Array(2043303, 100, 1, 3), //短剑
        Array(2043703, 100, 1, 3), //短杖
        Array(2043803, 100, 1, 3), //长杖
        Array(2044003, 100, 1, 3), //双手剑
        Array(2044019, 100, 1, 3), //双手剑魔力
        Array(2044103, 100, 1, 3), // 斧头
        Array(2044203, 100, 1, 3), //钝器
        Array(2044303, 100, 1, 3), //枪攻击
        Array(2044403, 100, 1, 3), //矛攻击
        Array(2044503, 100, 1, 3), //弓攻击
        Array(2044603, 100, 1, 3), //弩
        Array(2044703, 100, 1, 3), //全套
        Array(2044815, 100, 1, 3), //指节
        Array(2044908, 100, 1, 3)  //短枪
        );


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        im.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "祖母绿抽奖礼包", notice);
            if (item != -1) {
                im.gainItem(2430069, -1);
                im.gainItem(4310030, 10);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个，额外得到10个运动会币的奖励，可以在游戏商店中兑换#b运动会装备#k和#b必成卷轴#k。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.gainItem(2430069, -1);
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}