function start() {
	var selStr = "- #e#d耽误您一分钟请务必认真看完。#k#n\r\n\r\n";
	selStr +="#e#r1).#n #d请您加入芒果交流群 （71686495） 以便及时获得最新消息方便您和芒果其他玩家交流芒果官方网站：www.52mgmxd.com. 请您经常查看群公告和芒果官网动态所有信息都在这两处公布不喜欢看公告和芒果官网的玩家损失自己负责管理不提供任何补偿方式。\r\n";
	selStr +="#e#r2).#n #b芒果属于超强仿官方版本真正独立光纤双线服务器，长期稳定，不删档，福利活动多。同步官方版本 BUG完美修复全职业开放。拥有很多特色副本适合长期发展的玩家定居经验倍数25倍金币倍数10倍游戏爆率5倍.芒果冒险岛中介币可以放进玩家自己开的商店卖哦\r\n";
	selStr +="#e#r3).#n #d芒果可以使用的命令可以在游戏中对话框输入 @help查看， 常用命令有：#r@fh{回到市场}  @pm {打开拍卖面板}  @ea {在点不了NPC时使用}  @fh {死亡后消耗金币原地复活}  @删除盾牌{恶魔职业删除盾牌使用}.\r\n";
	selStr +="#e#r4).#n #b背包里赠送的基础礼物箱子，当你等级达到一定的时候会赠送您一些药水，当点卷或者抵用足够买宠物时可以先去商城买个宠物，然后打开宠物栏勾选上（捡取道具） 宠物就就可以自动捡取道具了，所有职业每次转职能自动获得职业武器1把 特殊点的职业 林之灵 龙神 等 无法获得职业武器的 请您去各村子武器商店购买 当等级达到30级， 60级，100级，160级, 210级， 250级，达到这些等级 可以在 “拍卖》更多服务》等级奖励”中领取等级奖励，250级更是可以获得不可思议的奖励物品.\r\n";
	selStr +="#e#r5).#n #d怪物都会掉落RED币此物品收集到一定数量可以在“拍卖》游戏商店》RED币商店”购买物品芒果技能书出处可以通过怪物及BOOS掉落职业能手册开出来也可以通过世界怪物掉落的神秘能手册开出来，也可以去打宝地图，此地图爆率比野外高很多，可以让玩家快速获得神秘技能册.\r\n";
	selStr +="#e#r6).#n #b市场泡点每60秒可以全服任何地图可以获得2点卷2抵用，自由市场可以获得双倍，并且在12小时，18小时在线奖励可以领取总计1W8的抵用卷上班族没时间玩可以挂在市场哦，这对于您的变强很有帮助.\r\n";
	selStr +="#e#r7).#n #d法弗纳150级武器系列可以通过市场NPC武器制作自己制作，武器需要的材料获得方式很多（通过组队任务 BOOS 游戏副本 积分来兑换制作材料）（也可以通过钓鱼积分来兑换制作材料）（也可以通过每日任务活力值来兑换制作材料）还可以打BOOS获得材料获得方式多种多样 关于其它装备 请您自行在游戏中探寻或者在芒果交流群和朋友们 交流.\r\n";
	selStr +="#e#r8).#n #b部分道具的出处。运动会币可以去副本获得，征服币可以去完成（阿里安特）副本获得，RED币 所有怪物掉落，以及神秘之冰随机开出 ，（正义火种）可以取完成组队任务{废弃组队}副本随机获得，BOOS也有一定的概率掉落，在线时间奖励 也可以获得火种 等其它道具，每周7天连续签到 也能获得很多道具 更有全属性装备哦.\r\n";
	selStr +="#e#r9).#n #d美容美发拍卖里面的整形医院能把玩家传送到射手村美容店，使用万能美发卷和万能整容卷自己选择普通发型脸型  高级发型脸型只能在 自由市场的美容NPC 使用皇家美发卷 和皇家整容卷 随机随出来.\r\n";
	selStr +="#e#r10).#n #b新手成长说明：1升级方式1-100级除了打怪还是打怪 100-160 级 现在您已经四转了 拥有了强力技能 可以选择刷进化系统副本来快速升级此副本属于超级升级副本 除了大量经验什么都没有 也可以选择其它方式升级 选择其它方式升级的 进度自然慢一点 不过能获得很多道具 金币等 160-250级 这个阶段 您只能去找朋友带BOOS或者自己去打BOOS升级 有时间去打宝地图刷技能书 道具等等一些物品 慢慢来强化自己的装备 增强自身的实力160级开始  领取完等级奖励 您就已经成长起来了，就得开始强化自身的实力了 增强实力的方式大家都知道的 就不一一说明了 高级BOOS 没有一定实力是打不动的.\r\n";
	selStr +="#e#r11).#n #d芒果会员分为土豪和平民2种方式，具体内容“拍卖》 芒果理财》”查询.\r\n";
	selStr +="#e#r12).#n #b本服福利活动非常多有天天福利活动大型活动等等 活动请留意群公告 和芒果官方网站.\r\n";
	selStr +="#e#r13).#n #d关于推广福利说明：您介绍朋友进来务必要求您的朋友填写您的游戏账户 （是游戏账户 不是角色名字）朋友填好您的账户 您和您的朋友都能获得一定的福利 您朋友等级达到180级 您和您朋友能再次获得一定的福利. \r\n如果您介绍的是土豪朋友，您将获得更多的福利\r\n您的土豪朋友充值 您就能自动获得朋友充值金额10%的点卷 此推广福利长期有效\r\n";
	selStr +="#e#r附加说明 ：\r\n#n #b所有说明都是有限的 做不到十全十美 具体功能全部以游戏内容为准 很多内容需要玩家自己在游戏中体验探索。\r\n所有利用BUG谋取福利的玩家 直接珊号处理 对不起 请您从新开始\r\n芊芊在此祝福您 \在芒果玩的开心快乐！";
	im.sendOk(selStr);
         //im.sendOk("- #e#d本服玩家交流群：2335015#k#n\r\n\r\n#b1). #r新手玩家会赠送有起步资金，建议先去商城购买个宠物，然后按开E，选择宠物栏位，够选上宠物拣取道具。\r\n#b2). #r建议先了解市场NPC以及#b拍卖#r上面的功能，升级途中会掉落神秘之冰，神秘之冰会开出高级装备所需要的硬币以及魔方卷轴等等。拍卖上面有RED币商店，以及市场#b#p9900001##r处有征服者币商店，可以进行购买。\r\n#b3). #r怪物会有几率掉落抵用卷物品。有几率性掉落500/1000/1500/3000/4000等商品卷。双击使用后会获得大量抵用卷。\r\n#b4). #r本服市场挂机30秒将会获得1积分，积分可以在#b拍卖#r处在线兑换兑换点卷，魔方，120-140装备，卷轴等等。\r\n#b5). #r本服每天基本都有活动举行，活动奖品很丰富，活动会奖励点卷，魔方，高级卷轴，高级装备，稀有点装，椅子等等。\r\n#b6). #r本服150武器可以自己去打材料在市场#b#p9900001##r处制作。材料的出处，以及技能书等等都在群共享里。\r\n#b7). #r本服正在努力做到更好中，如果您有什么建议或者意见，请加我们的玩家交流群联系群主，最后感谢您的到来。");
	im.worldSpouseMessage(0x14,"『毛莫的信』：玩家 "+ im.getChar().getName() +" 对本服不了解查看了本服介绍说明书。");
        im.dispose(); 
}
